import pytest
from numbers_dict import *


@pytest.mark.parametrize("input_value, expected_output", [
    ("ноль", 0),
    ("один", 1),
    ("десять", 10),
    ("одиннадцать", 11),
    ("двадцать три", 23),
    ("сто", 100),
    ("сто пять", 105),
    ("сто пятьдесят", 150),
    ("пять тысяч", 5000),
    ("одна тысяча", 1000),
    ("тысяча двести пятьдесят два", 1252),
    ("миллион", 1_000_000),
    ("пять миллионов", 5_000_000),
    # Negative
    ("минус один", -1),
    ("минус сорок два", -42),
    ("минус тысяча сто один", -1101),
    ("минус ноль", 0)

]
                         )
def test_parse_word_to_number(input_value, expected_output) -> None:
    result = parse_word_to_number(input_value)

    # Assert
    assert result == expected_output


@pytest.mark.parametrize("input_value, expected_output", [
    (0, 'ноль'),
    (1, 'один'),
    (10, 'десять'),
    (15, 'пятнадцать'),
    (20, 'двадцать'),
    (25, 'двадцать пять'),
    (42, 'сорок два'),
    (99, 'девяносто девять'),
    (100, 'сто'),
    (101, 'сто один'),
    (110, 'сто десять'),
    (115, 'сто пятнадцать'),
    (199, 'сто девяносто девять'),
    (342, 'триста сорок два'),
    (999, 'девятьсот девяносто девять'),
    (1000, 'одна тысяча'),
    (1001, 'одна тысяча один'),
    (1010, 'одна тысяча десять'),
    (1100, 'одна тысяча сто'),
    (1115, 'одна тысяча сто пятнадцать'),
    (2000, 'две тысячи'),
    (2025, 'две тысячи двадцать пять'),
    (10000, 'десять тысяч'),
    (21000, 'двадцать одна тысяча'),
    (999999, 'девятьсот девяносто девять тысяч девятьсот девяносто девять'),
    (1000000, 'один миллион'),
    (1000001, 'один миллион один'),
    (1000100, 'один миллион сто'),
    (1100000, 'один миллион сто тысяч'),
    (999999999, 'девятьсот девяносто девять миллионов девятьсот девяносто девять тысяч девятьсот девяносто девять'),
    (-1, 'минус один'),
    (-52, 'минус пятьдесят два'),
    (-1000, 'минус одна тысяча'),
    (-1000000, 'минус один миллион')
])
def test_parse_number_to_word(input_value, expected_output) -> None:
    result = parse_number_to_word(input_value)

    # Assert
    assert result == expected_output
