UNITS: dict[str, int] = {'ноль': 0,
                         'один': 1,
                         'одна': 1,
                         'два': 2,
                         'две': 2,
                         'три': 3,
                         'четыре': 4,
                         'пять': 5,
                         'шесть': 6,
                         'семь': 7,
                         'восемь': 8,
                         'девять': 9}

UNITS_GENDER: dict[int, dict[str, str]] = {
    1: {"masculine": "один",
        "feminine": "одна"},
    2: {"masculine": "два",
        "feminine": "две"},
    # Остальные числа не меняются по роду
    3: {"masculine": "три",
        "feminine": "три"},
    4: {"masculine": "четыре",
        "feminine": "четыре"},
    5: {"masculine": "пять",
        "feminine": "пять"},
    6: {"masculine": "шесть",
        "feminine": "шесть"},
    7: {"masculine": "семь",
        "feminine": "семь"},
    8: {"masculine": "восемь",
        "feminine": "восемь"},
    9: {"masculine": "девять",
        "feminine": "девять"}
}

TEENS: dict[str, int] = {'десять': 10,
                         'одиннадцать': 11,
                         'двенадцать': 12,
                         'тринадцать': 13,
                         'четырнадцать': 14,
                         'пятнадцать': 15,
                         'шестнадцать': 16,
                         'семнадцать': 17,
                         'восемнадцать': 18,
                         'девятнадцать': 19}

TENS: dict[str, int] = {'двадцать': 20,
                        'тридцать': 30,
                        'сорок': 40,
                        'пятьдесят': 50,
                        'шестьдесят': 60,
                        'семьдесят': 70,
                        'восемьдесят': 80,
                        'девяносто': 90}

HUNDREDS: dict[str, int] = {"сто": 100,
                            "двести": 200,
                            "триста": 300,
                            "четыреста": 400,
                            "пятьсот": 500,
                            "шестьсот": 600,
                            "семьсот": 700,
                            "восемьсот": 800,
                            "девятьсот": 900}

ORDERS: dict[str, int] = {"тысяча": 1000,
                          "тысячи": 1000,
                          "тысяч": 1000,
                          "миллион": 1_000_000,
                          "миллиона": 1_000_000,
                          "миллионов": 1_000_000}

FRACTION_DENOMINATORS: dict[str, int] = {
    'десятая': 10, 'десятых': 10,
    'сотая': 100, 'сотых': 100,
    'тысячная': 1000, 'тысячных': 1000,
    'десятитысячная': 10_000, "десятитысячных": 10_000,
    'стотысячная': 100_000, "стотысячных": 100_000,
    'миллионная': 1_000_000, "миллионных": 1_000_000
}

FORMS: dict[str, tuple] = {
    'thousand': ('тысяча', 'тысячи', 'тысяч'),
    'million': ('миллион', 'миллиона', 'миллионов'),
    'denominator_10': ('десятая', 'десятых', 'десятых'),
    'denominator_100': ('сотая', 'сотых', 'сотых'),
    'denominator_1000': ('тысячная', 'тысячных', 'тысячных'),
    'denominator_10000': ('десятитысячная', "десятитысячных", "десятитысячных"),
    'denominator_100000': ('стотысячная', 'стотысячных', 'стотысячных'),
    'denominator_1000000': ('миллионная', 'миллионных', 'миллионных')
}
