UNITS: dict[str, int] = {'ноль': 0,
                         'один': 1,
                         'два': 2,
                         'три': 3,
                         'четыре': 4,
                         'пять': 5,
                         'шесть': 6,
                         'семь': 7,
                         'восемь': 8,
                         'девять': 9}

UNITS_UNIQUE: dict[str, int] = {'одна': 1,
                                'две': 2}

TEENS: dict[str, int] = {'десять': 10,
                         'одиннадцать': 11,
                         'двенадцать': 12,
                         'тринадцать': 13,
                         'четырнадцать': 14,
                         'пятнадцать': 15,
                         'шестнадцать': 16,
                         'семнадцать': 17,
                         'восемнадцать': 18,
                         'девятнадцать': 19}

TENS: dict[str, int] = {'двадцать': 20,
                        'тридцать': 30,
                        'сорок': 40,
                        'пятьдесят': 50,
                        'шестьдесят': 60,
                        'семьдесят': 70,
                        'восемьдесят': 80,
                        'девяносто': 90}

HUNDREDS: dict[str, int] = {
    "сто": 100,
    "двести": 200,
    "триста": 300,
    "четыреста": 400,
    "пятьсот": 500,
    "шестьсот": 600,
    "семьсот": 700,
    "восемьсот": 800,
    "девятьсот": 900
}

ORDERS: dict[str, int] = {
    "тысяча": 1000,
    "тысячи": 1000,
    "тысяч": 1000,
    "миллион": 1_000_000,
    "миллиона": 1_000_000,
    "миллионов": 1_000_000,
}

FRACTION_DENOMINATORS: dict[str, int] = {
    'десятая': 10,
    'десятых': 10,
    'сотая': 100,
    'сотых': 100,
    'тысячная': 1000,
    'тысячных': 1000
}
